bbb/backend/classest/KNLogFunc.php

    public static function addLog($type, $name, $detail){
       try{
           $model = new \backend\models\Systemlog();
           $model->id = \cpn\chanpan\utils\CNUtils::getMillisecTime();
           $model->logname = $name;
           $model->logtype = $type;
           $model->logdetail = $detail;
           $model->rstat = 1;
           $model->create_by = \common\modules\user\classes\CNUserFunc::getUserId();
           $model->create_date = date('Y-m-d H:i:s');
           $model->ip = CNUtils::getCurrentIp();
           if($model->save()){
---
INSERT INTO `systemlog` (`id`, `logname`, `logtype`, `logdetail`, `rstat`, `create_by`, `create_date`, `ip`) VALUES (1567740283033906100, 'Login', 1, 'Login โดย: 14:Sale Sale1 IP: 223.206.251.249', 1, 14, '2019-09-06 10:24:43', '223.206.251.249')