bbb/backend/modules/core/classes/CoreQuery.php

    public static function getOptionsParams() {
	$model = \common\models\Options::find()
		->select('label, value')
		->all();
---
SELECT `label`, `value` FROM `options`