bbb/backend/views/bill-items/index.php

SELECT * FROM `bill_type` WHERE `id`='1'
SELECT * FROM `bill_type` WHERE type=1
---
                                 'attribute'=>'bill_type',
                                'value' => function($model) {
                                    $url = \yii\helpers\Url::to(['/select2/bill-type?type=1']);
                                    $data = isset($model->bill_type) ? backend\models\BillType::findOne($model->bill_type) : '';
                                    return isset($data['name'])?$data['name']:'ไม่ได้ตั้ง';
                                },
                                'filter'=>\yii\helpers\ArrayHelper::map(BillType::find()->where('type=1')->asArray()->all(), 'id', 'name'),

SELECT * FROM `bill_status` WHERE `id`=1
SELECT * FROM `bill_status` WHERE rstat not in(0,3)
---
                                        return isset($model->statuss->name) ? $model->statuss->name : '';
                                    }
                                },
                                'filter' => kartik\select2\Select2::widget([
                                    'model' => $searchModel,
                                    'attribute' => 'status',
                                    'data' => \yii\helpers\ArrayHelper::map(\backend\models\search\BillStatus::find()->where('rstat not in(0,3)')->all(), 'id', 'name'),
                                    //'theme' => kartik\select2\Select2::THEME_BOOTSTRAP,
                                    'hideSearch' => false,
                                    'options' => [
                                        'placeholder' => 'เลือกสถานะบิล',
                                    ],
                                    'pluginOptions' => [
                                            'allowClear' => true,
                                    ],
                                ]),

SELECT * FROM `bill_status_shipping` WHERE `id`='3'
SELECT * FROM `bill_status_shipping` WHERE rstat not in(0,3)
---
                                'value' => function($model) {
                                    return isset($model->shippings->name)?$model->shippings->name:'ยังไม่จัดสินค้า';
                                },
                                'filter' => kartik\select2\Select2::widget([
                                    'model' => $searchModel,
                                    'attribute' => 'shiping',
                                    'data' => \yii\helpers\ArrayHelper::map(\backend\models\search\BillStatusShipping::find()->where('rstat not in(0,3)')->all(), 'id', 'name'),

                                    'hideSearch' => false,
                                    'options' => [
                                        'placeholder' => 'สถานะการส่งสินค้า',
                                    ],
                                    'pluginOptions' => [
                                            'allowClear' => true,
                                    ],
                                ]),

SELECT * FROM `bill_status_charge` WHERE `id`=5
SELECT * FROM `bill_status_charge` WHERE rstat not in(0,3)
---
                                'value' => function($model) {
                                    return isset($model->charge) ? $model->charges->name : '';
                                },
                                'filter' => kartik\select2\Select2::widget([
                                    'model' => $searchModel,
                                    'attribute' => 'charge',
                                    'data' => \yii\helpers\ArrayHelper::map(\backend\models\search\BillStatusCharge::find()->where('rstat not in(0,3)')->all(), 'id', 'name'),
                                    //'theme' => kartik\select2\Select2::THEME_BOOTSTRAP,
                                    'hideSearch' => false,
                                    'options' => [
                                        'placeholder' => 'สถานะเก็บเงิน',
                                    ],
                                    'pluginOptions' => [
                                            'allowClear' => true,
                                    ],
                                ]),

SELECT * FROM `bill_packagers` WHERE (`bill_id`=1567675497008961600) AND (rstat not in(0,3))
---
                                'label'=>'พนักงานจัดสินค้า',
                                'value'=>function($model){
                                    $html = "";
                                    $package = \backend\models\BillPackagers::find()->where(['bill_id'=>$model->id])->andWhere('rstat not in(0,3)')->all();