bbb/backend/controllers/BillItemsController.php

SELECT * FROM `bill_items` ORDER BY `billno` DESC
INSERT INTO `bill_items` (`billno`, `id`, `blog`, `bill_date`, `bill_type`, `billref`, `bookno`, `amount`, `status`, `shiping`, `charge`, `difficulty`, `billtype`, `remark`, `shop_id`, `rstat`) VALUES ('15408', 1567676048043376100, '7', '2019-09-05', '1', '1908-00442', '', '104432', 3, '', 11, NULL, NULL, '', 0, 1)
---
    public function actionCreate()
    {
	if (Yii::$app->getRequest()->isAjax) {

            $model = new BillItems();
            $billno = 0001;
            $lastrecord = BillItems::find()->orderBy(['billno'=>SORT_DESC])->one();
            if($lastrecord){
                $billno = $lastrecord['billno']+1;
            }
            $model->billno = sprintf("%05d",$billno);
            $model->id = \appxq\sdii\utils\SDUtility::getMillisecTime();

	    if ($model->load(Yii::$app->request->post())) {

                $model->shop_id = 0;
//                $model->btype =1;
//                $model->status=1;
//                $model->charge=1;
//                $model->amount=0;
//                $model->amount='0';
                $model->rstat=1;
		if ($model->save()) {

SELECT * FROM `files` WHERE bill_id='1567676359039284900' AND rstat not in(0,3) ORDER BY `id` DESC
---
    public function actionPreviewImage($id) {
            $files = \backend\models\Files::find()->where('bill_id=:bill_id AND rstat not in(0,3)', [
                        ':bill_id' => $id
                    ])->orderBy(['id' => SORT_DESC])->all();

SELECT * FROM `groups` WHERE id='7'
SELECT * FROM `bill_items` WHERE billno='15001'
---
    public function actionGetBillno() {
        $id = Yii::$app->request->get('id','');
        $model = \backend\models\Groups::find()->where('id=:id',[':id'=>$id])->one();
        if($model){
            $value = "1";
            if(!isset($model->selecteds) || $model->selecteds == ''){
                if(isset($model->value) && $model->value != ''){
                    $value = $model->value; //default
                    $model->selecteds = $value;
                    $model->save();

                }
            }else{
                $value = (int)$model->selecteds;
                $value = sprintf("%05d",$value);
                $billItems = BillItems::find()->where('billno=:billno',[':billno'=>$value])->one();